---
kind: property
id: P:Autodesk.Revit.DB.Form.IsInXRayMode
zh: 对话框、窗口、窗体
source: html/22f103aa-4091-87b6-aa69-6336d3b24bf7.htm
---
# Autodesk.Revit.DB.Form.IsInXRayMode Property

**中文**: 对话框、窗口、窗体

Get/set if the form is in X-Ray mode.

## Syntax (C#)
```csharp
public bool IsInXRayMode { get; set; }
```